<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta name="HandheldFriendly" content="True">
<meta name="MobileOptimized" content="320">
<meta name="viewport" content="initial-scale=1.0, minimum-scale=1.0, maximum-scale=1.0, user-scalable=no">
<title>课程列表</title>

<script src="${pageContext.request.contextPath}/js/jquery-1.11.2.min.js"></script>
<link rel="stylesheet" type="text/css" href="${pageContext.request.contextPath}/css/base.css">
<link rel="stylesheet" type="text/css" href="${pageContext.request.contextPath}/css/app-style.css">

</head>
<body>
<div class="context_box">
	<div class="warp_box">
		<div class="article_title">课程列表</div>
		<div class="article">
		<p>学龄前科技课程</p>
		<table>
			<tr>
				<th>小小乐高3+</th>
			</tr>
			<tr>
				<td><p>3岁是小朋友启蒙的再续，针对这个年龄阶段，我们重点在于培养其手眼协调，语言表达，空间方位感知，体验并发现世界的能力。在搭建的过程中，锻炼大肌肉群发展，使其身心得到锻炼。
				</p></td>
			</tr>
			<tr>
				<th>百变工程 4+</th>
			</tr>
			<tr>
				<td><p>将平时观察到的周围事物，通过他们的想象和创意，与同伴们一起分析、讨论并制作有用的工具去完成任务。例如：空中救险、海上航行、小小建筑师等。
				</p></td>
			</tr>
			<tr>
				<th>数字游戏4+</th>
			</tr>
			<tr>
				<td><p>在遵守游戏规则的前提下，孩子们可以参与各种游戏及自我创新的项目，例如：我们会用我们自己的积木搭建一个游戏比如飞行棋，去结合游戏规则和数学的应用让孩子快乐与认真的学习。在积木的搭建过程中，插入数码的识别，数字的简单计算，在一些小游戏中让小朋友认识数学并感知数学的魅力。鼓动孩子的积极性，并培养孩子全局思考问题的能力。
				</p></td>
			</tr>
			<tr>
				<th>生活与科技5+</th>
			</tr>
			<tr>
				<td><p>搭建生活中常见的工具及电器模型，探索生活中的科学原理。如：了解杠杆、轮轴、滑轮、齿轮等的作用，使孩子建立对科学的感性认识，理解生活中的科技无处不在，增强观察力后就会发现很多的“问题”，在探究简单问题的过程中使思维得到锻炼和提高。
				</p></td>
			</tr>
			<tr>
				<th>早期简单机械5+</th>
			</tr>
			<tr>
				<td><p>广泛使用并介绍杠杆、轮轴、滑轮、齿轮等，对图卡的阅读和自我创造得到发展，使搭建过程能灵活体现自己的想法和特点，在整个过程中能让他们感受创造发明的无限乐趣。
				</p></td>
			</tr>
		</table>
		<p>学龄后科技课程</p>
		<table>
			<tr>
				<th>探索与发现6+</th>
			</tr>
			<tr>
				<td><p>课程表现两个主题：“太空与陆地探险”、“海洋与时空”。让孩子们在一系列有趣的挑战和任务中学习地理、历史知识以及解决问题的能力。此外还能丰富孩子的词汇，发展叙述和表达语言的能力，发展创造性思维和解决问题的方法，以及团队合作精神。
				</p></td>
			</tr>
			<tr>
				<th>百变工程 4+</th>
			</tr>
			<tr>
				<td><p>将平时观察到的周围事物，通过他们的想象和创意，与同伴们一起分析、讨论并制作有用的工具去完成任务。例如：空中救险、海上航行、小小建筑师等。
				</p></td>
			</tr>
			<tr>
				<th>迷你机械6+</th>
			</tr>
			<tr>
				<td><p>课程大多侧重于培养孩子们在社会生活中关于科学、技术、工程和数学的技能，培养他们的创造能力和与人沟通交流的能力。
				</p></td>
			</tr>
			<tr>
				<th>动力机械7+</th>
			</tr>
			<tr>
				<td><p>通过搭建和创意之后配以初步程序的编写，使自己的作品“复活”，从而能够执行编者命令的智能机械，从中获得的关键知识和技能有：分析、设计和编程、完成指定的设计任务，测试和推理。
				</p></td>
			</tr>
			<tr>
				<th>早期编程7+</th>
			</tr>
			<tr>
				<td><p>孩子已经对于利用纯电力来控制机械表现的不在热衷。我需要一个新的课程。让我们的机械活起来。他们能够想，他们会改变，他们会看。这就是我们的编程机械。从原来的动力机械设计模范阶段到创意的过程。通过搭建和创意之后配以初步程序的编写概念。使自己的作品“复活”，从而能够执行编者命令的智能机械，学生从中获得的关键知识和技能有：分析、设计和编程、完成指定的设计任务、测试和推理。</p></td>
			</tr>
			<tr>
				<th>能源世界8+</th>
			</tr>
			<tr>
				<td><p>将抽象的基本能量原理简单化、形象化、直观地揭示能量的产生、储存及使用过程和功、功率与能量三者的关系。如：太阳能驱动的小车拔河、爬坡比赛，使用电容来储存能量，风力发电模型等。</p></td>
			</tr>
			<tr>
				<th>机械与应用8+</th>
			</tr>
			<tr>
				<td>
					<p>本期课程主要是回顾与总结以前所学习的机械原理，突出生活化机械应用。课程设计中，我们通过气动力和木工DIY两大板块来支持该期授课活动。</p>
					<p>气动力课程以乐高器材9641和9686为教学器材配套使用，贯穿气压原理分析及搭建机械手、起落架、稻草人和恐龙等课程。木工DIY是继续沿袭机械构造探究的目的，通过分析分解这款迷你12V电压的实体模型，用乐高积木搭建并呈现这种工作运动方式，例如钻、切、铣和磨。该迷你模型的推出，还可以让小朋友在了解了机械构造原理之后，进行实际木板的切割、钻孔等试验，继续探索机械工具在生活中的应用。从而逐步形成动手理论知识到实际生活应用的良性升华过程，形成良好的学习习惯，融会贯通并平衡多种能力：即分析、实践、创造。</p>
				</td>
			</tr>
			<tr>
				<th>机器人课程</th>
			</tr>
			<tr>
				<td><p>通过搭建和创意设计，了解程序给机械带来的智能。我们做的是“能够自动运行的机器”！如沿轨迹行的机器人、碰碰车、智能化交通装置、搬运机器人等等。向国际机器人大赛发起冲击和挑战！</p></td>
			</tr>
			<tr>
				<th>机器人初级班9+</th>
			</tr>
			<tr>
				<td><p>机器人（Robot）是自动执行工作的机器装置。他既可以接受人类指挥，又可以运行预先编排的程序，也可以根据以人工智能技术指定的原则纲领行动。它的任务是协助或取代人类工作的工作，例如生产业、建筑业、或是危险的工作</p></td>
			</tr>
			<tr>
				<th>机器人中级班10+</th>
			</tr>
			<tr>
				<td><p>在初级机器人的认知基础上，更加深化和完善孩子们的知识体系。使孩子从原来的设计模仿过渡到创意阶段，达到综合掌握机器人设计的基本工作。课程中从原有了解到编程软件初级控件进阶到中高级数控型编程控件，让孩子能够尝试着去挑战更繁琐、更精彩的机器人世界，为成为一流的设计型人才进行备战。</p></td>
			</tr>
		</table>
		</div>
	</div>
	<jsp:include page="../include/footer.jsp"/>
</div>
</body>
</html>